# AddResource Method

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ExternalResourceBrowserData..::..AddResource Method
ExternalResourceBrowserData Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AddResource(String) | Adds an external resource to the folder path by supplying the resource name. |
| AddResource(String, IDictionary<(Of <<'(String, String>)>>)) | Adds an external resource to the folder path by supplying the resource name and reference information. |
| AddResource(String, String) | Adds an external resource to the folder path by supplying the resource name and version. |
| AddResource(String, String, IDictionary<(Of <<'(String, String>)>>)) | Adds an external resource to the folder path by supplying the resource name, version and reference information. |

# See Also
ExternalResourceBrowserData Class
ExternalResourceBrowserData Members
Autodesk.Revit.DB Namespace